In [1]:
!pip install SQLAlchemy

Requirement already satisfied: SQLAlchemy in c:\users\indrocks\anaconda3\lib\site-packages (1.3.9)

In [2]:
import pandas as pd

In [3]:
from sqlalchemy import create_engine
import mysql.connector

In [4]:
engine=create_engine("mysql+mysqlconnector://root:"+'1234'+"@localhost/testdb")

pandas.read_sql_table

In [5]:
df=pd.read_sql_table("employee",engine)
df

   eid   ename           emailid   did
0    1    John    john@gmail.com  1002
1    2    Josh    josh@gmail.com  1004
2    3  Andrew  andrew@gmail.com  1003
3    4   Henry   henry@yahoo.com  1001
4    5   Kiara   kiara@yahoo.com  1001
5    6   Shree   shree@yahoo.com  1004

In [6]:
df1=pd.read_sql_table("employee",engine,columns=['ename'])
df1

    ename
0    John
1    Josh
2  Andrew
3   Henry
4   Kiara
5   Shree

In [7]:
pd.read_sql_table?

In [8]:
df1=pd.read_sql_table("employee",engine,columns=['ename','emailid'])
df1

    ename           emailid
0    John    john@gmail.com
1    Josh    josh@gmail.com
2  Andrew  andrew@gmail.com
3   Henry   henry@yahoo.com
4   Kiara   kiara@yahoo.com
5   Shree   shree@yahoo.com

In [9]:
df1=pd.read_sql_table("employee",engine,columns=['ename','emailid','did'])
df1

    ename           emailid   did
0    John    john@gmail.com  1002
1    Josh    josh@gmail.com  1004
2  Andrew  andrew@gmail.com  1003
3   Henry   henry@yahoo.com  1001
4   Kiara   kiara@yahoo.com  1001
5   Shree   shree@yahoo.com  1004

pandas.read_sql_query

pandas.read_sql_query(sql,con,index_col=None,coerce_float=true,params=None, parse_dates=None, chunksize=None)
[souse] Read SQL query into a DataFrame.

In [10]:
df1=pd.read_sql_query("Select * from employee",engine)
df1

   eid   ename           emailid   did
0    1    John    john@gmail.com  1002
1    2    Josh    josh@gmail.com  1004
2    3  Andrew  andrew@gmail.com  1003
3    4   Henry   henry@yahoo.com  1001
4    5   Kiara   kiara@yahoo.com  1001
5    6   Shree   shree@yahoo.com  1004

In [11]:
df1=pd.read_sql_query("Select ename,emailid from employee ",engine)
df

   eid   ename           emailid   did
0    1    John    john@gmail.com  1002
1    2    Josh    josh@gmail.com  1004
2    3  Andrew  andrew@gmail.com  1003
3    4   Henry   henry@yahoo.com  1001
4    5   Kiara   kiara@yahoo.com  1001
5    6   Shree   shree@yahoo.com  1004